ЖКХ/src/InformationRegisters/ТарифыИнтервальный/ТарифыИнтервальный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыИнтервальный</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РесурсУслуга</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/InformationRegisters/Тарифы/Тарифы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Тарифы</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РесурсУслуга</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/CommonModules/ТарифыЖКХ/Module.bsl
#Область ПрограммныйИнтерфейс

// Полностью пересобирает регистр сведений "ТарифыИнтервальный" по данным регистра "Тарифы".
Процедура ПерестроитьИнтервалыТарифов() Экспорт

	ЗаблокироватьИнтервалыТарифов();

	ТарифыПоРесурсам = ПрочитатьТарифыПоРесурсам();

	Набор = РегистрыСведений.ТарифыИнтервальный.СоздатьНаборЗаписей();

	Для Каждого КлючИЗначение Из ТарифыПоРесурсам Цикл
		ЗаполнитьИнтервалыРесурса(Набор, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;

	Набор.Записать();

КонецПроцедуры

// Возвращает соответствие "услуга - тариф", действовавшее до указанной даты.
//
// Параметры:
//  СписокУслуг - Массив из Характеристика.ВидыРесурсов - услуги, по которым запрашиваются тарифы.
//  Дата - Дата - граница, до которой (включительно) берутся тарифы.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Характеристика.ВидыРесурсов - услуга.
//   * Значение - Число - действовавший тариф.
//
Функция ТарифыНаДату(СписокУслуг, Дата) Экспорт

	Результат = Новый Соответствие;

	Если СписокУслуг.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифыСрезПоследних.РесурсУслуга КАК РесурсУслуга,
	|	ТарифыСрезПоследних.Тариф КАК Тариф
	|ИЗ
	|	РегистрСведений.Тарифы.СрезПоследних(&Дата, РесурсУслуга В (&Услуги)) КАК ТарифыСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуги", СписокУслуг);

	Для Каждого СтрокаРезультата Из Запрос.Выполнить().Выгрузить() Цикл
		Результат.Вставить(СтрокаРезультата.РесурсУслуга, СтрокаРезультата.Тариф);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Блокирует регистр "ТарифыИнтервальный" на время пересбора.
Процедура ЗаблокироватьИнтервалыТарифов()

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ТарифыИнтервальный");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	Попытка
		Блокировка.Заблокировать();
	Исключение
		// Конфликт блокировок при параллельной записи тарифов: прерываем запись,
		// причина попадает в журнал регистрации.
		ЗаписьЖурналаРегистрации(
			"ЖКХ.Блокировка тарифов",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Возвращает активные тарифы, сгруппированные по ресурсу-услуге.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Характеристика.ВидыРесурсов - ресурс-услуга.
//   * Значение - Массив из СтрокаТаблицыЗначений - активные записи регистра по ресурсу.
//
Функция ПрочитатьТарифыПоРесурсам()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Тарифы.РесурсУслуга КАК РесурсУслуга,
	|	Тарифы.Период КАК Период,
	|	Тарифы.Тариф КАК Тариф
	|ИЗ
	|	РегистрСведений.Тарифы КАК Тарифы
	|ГДЕ
	|	Тарифы.Активность
	|
	|УПОРЯДОЧИТЬ ПО
	|	РесурсУслуга,
	|	Период";
	ТаблицаТарифов = Запрос.Выполнить().Выгрузить();

	ТарифыПоРесурсам = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаТарифов Цикл
		ЗаписиРесурса = ТарифыПоРесурсам[СтрокаТаблицы.РесурсУслуга];
		Если ЗаписиРесурса = Неопределено Тогда
			ЗаписиРесурса = Новый Массив;
			ТарифыПоРесурсам.Вставить(СтрокаТаблицы.РесурсУслуга, ЗаписиРесурса);
		КонецЕсли;
		ЗаписиРесурса.Добавить(СтрокаТаблицы);
	КонецЦикла;

	Возврат ТарифыПоРесурсам;

КонецФункции

// Добавляет в набор записей интервалы действия тарифа для одного ресурса-услуги.
//
// Параметры:
//  Набор - РегистрСведенийНаборЗаписей.ТарифыИнтервальный - набор записей регистра.
//  РесурсУслуга - Характеристика.ВидыРесурсов - ресурс-услуга.
//  ЗаписиТарифов - Массив из СтрокаТаблицыЗначений - активные записи регистра по ресурсу.
//
Процедура ЗаполнитьИнтервалыРесурса(Набор, РесурсУслуга, ЗаписиТарифов)

	Для Индекс = 0 По ЗаписиТарифов.Количество() - 1 Цикл

		Запись = Набор.Добавить();
		Запись.РесурсУслуга = РесурсУслуга;
		Запись.ДатаНачала = ЗаписиТарифов[Индекс].Период;
		Запись.Тариф = ЗаписиТарифов[Индекс].Тариф;

		Если Индекс < ЗаписиТарифов.Количество() - 1 Тогда
			// Конец интервала - день, предшествующий началу следующего.
			Запись.ДатаОкончания = ЗаписиТарифов[Индекс + 1].Период - 1;
		Иначе
			// Открытый интервал - пустая дата означает отсутствие окончания.
			Запись.ДатаОкончания = Дата(1, 1, 1);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
